
  #### Terraform Plan
  <details>
    <summary>Expand</summary>
    <pre>Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/timovink/infra-shared/runs/run-e6JznQxxeNSasC9w

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
module.iam.aws_iam_user.deployer: Refreshing state... [id=deployer]
module.iam.aws_iam_user.tvink: Refreshing state... [id=tvink]
module.dns.aws_route53_zone.this["timovink.com"]: Refreshing state... [id=ZFMCDCUJ8UCFO]
module.iam.aws_iam_group.administrators: Refreshing state... [id=administrators]
module.iam.aws_iam_user_group_membership.deployer: Refreshing state... [id=terraform-20220604232226591200000002]
module.iam.aws_iam_user_group_membership.tvink: Refreshing state... [id=terraform-20220605021751235700000002]
module.iam.aws_iam_group_policy_attachment.administrators: Refreshing state... [id=administrators-20220605021751233100000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.dns.aws_route53_zone.this["timovink.app"] will be created
  + resource "aws_route53_zone" "this" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "timovink.app"
      + name_servers  = (known after apply)
      + tags_all      = {
          + "Project" = "tv-sharedinfra"
        }
      + zone_id       = (known after apply)
    }

  # module.dns.aws_route53_zone.this["timovink.ca"] will be created
  + resource "aws_route53_zone" "this" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "timovink.ca"
      + name_servers  = (known after apply)
      + tags_all      = {
          + "Project" = "tv-sharedinfra"
        }
      + zone_id       = (known after apply)
    }

  # module.dns.aws_route53_zone.this["timovink.com"] will be updated in-place
  ~ resource "aws_route53_zone" "this" {
      + comment       = "Managed by Terraform"
      + force_destroy = false
        id            = "ZFMCDCUJ8UCFO"
        name          = "timovink.com"
        tags          = {}
      ~ tags_all      = {
          + "Project" = "tv-sharedinfra"
        }
        # (3 unchanged attributes hidden)
    }

  # module.dns.aws_route53_zone.this["timovink.dev"] will be created
  + resource "aws_route53_zone" "this" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "timovink.dev"
      + name_servers  = (known after apply)
      + tags_all      = {
          + "Project" = "tv-sharedinfra"
        }
      + zone_id       = (known after apply)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

</pre>
  </details>
